# 自己离大厂的offer还差多少？

石杉老师好，我现在就职于一家物联网行业的公司，做的项目比较传统，应用到的技术栈与主流技术偏差较大，对于互联网行业的主流技术栈自己现在也在学习《互联网突击面试第一季》对整体技术知识进行扫盲

现在就以下几个角度分析一下自己所储备的技术知识和欠缺的技术点

## 技术广度

- JVM

  - 储备：理论知识
  - 不足：缺少实际运用

- 数据库

  - 储备：mysql数据库引擎，索引原理
  - 不足：SQL优化实战经验少，分库分表未扫盲，mysql底层B+Tree机制

- zookeeper

  - 储备：zap一致性协议，集群配置，分布式锁实现
  - 不足：paxos算法不清楚，使用场景不了解：分布式协调，配置信息管理

- redis缓存
  - 储备：数据结构，redis线程模型，缓存雪崩，穿透的应对措施，分布式锁，一致性hash算法，过期策略
  - 不足：redis与数据库双写一致性，主从复制原理，哨兵原理，集群模式，持久化机制，redis事务
- 消息队列
  - 储备：各类消息队列优缺点及使用场景
  - 不足：消息的可靠性，顺序性，如果保证消息不被重复消费  
- 搜索引擎
  - 储备：无
  - 不足：未知的知识点，需扫盲
- dubbo
  - 储备：demo工程使用
  - 不足：工作原理，负载均衡策略，集群容错策略，接口的幂等性如何设计，接口请求的顺序，服务治理，服务降级，失败重试，超时重试
- Spring Cloud
  - 储备：各个组件的功能作用
  - 不足：各个组件协调使用及组件底层的原理实现
- Spring Boot
  - 储备：熟悉环境搭建配置，热部署，核心组件的使用
  - 不足：实现原理
- 分布式限流降级
  - 储备：无
  - 不足：未知的知识点，需扫盲
- 分布式事务
  - 储备：无
  - 不足：未知的知识点，需扫盲

## 项目经验

基于互联网的技术，实际公司项目中并未涉及到这些技术，自己打算通过写一个秒杀项目来使用主流的技术栈，从未写过类似项目，不知道可行性有多大，细节可能要在实际做的过程中去发现，同时可能也会忽略到好多细节



## 技术深度

技术深度这块，对使用的Spring，mybatis的原理是熟悉的，源码层面看过myatis的源码和spring的源码



## 系统设计

系统设计过一个食堂消费的系统，人数控制在2W个人，设备200台，高峰期1秒20笔消费



## 总结

从技术广度上看，还需要恶补主流的技术栈，从项目经验上看，需要将主流的技术栈应用到实际项目中去，技术深度还远远不够，目前还停留在自己使用的技术上，系统设计层面也没有复杂性，需要跳出公司统一架构的范围，多思考更复杂的业务



## 问题

1.公司项目上是基本用不到，想自己手写或者去仿写一个类似的秒杀系统，然后运用主流的技术栈，这样的可行性有多高？从简单到秒杀业务入手，然后去进行微服务化，做系统拆分，这样是不是可以更快的上手新的技术知识



2.要学的东西比较多，学一个技术的同时，横向的比较其他类似的技术，这样学是不是效率会高些，
